# Pertemuan 4 Data Categorical

In [2]:
import pandas as pd

In [3]:
dataset = pd.read_csv('datacategorical.csv')

In [6]:
dataset.head()

   Country  Age  Salary Purchased
0   France   33    1000        No
1    Spain   22    1233       Yes
2  Germany   14    4500       Yes
3  Germany   56    3455       Yes
4    Spain   34    5000       Yes

In [7]:
dataset.shape

(9, 4)

In [5]:
pd.get_dummies(dataset['Country'])

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        1      0
4       0        0      1
5       0        0      1
6       1        0      0
7       1        0      0
8       1        0      0